backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      def set_user
        @user = User.find params[:id]